nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_common.h
/*
 *
 * Copyright (c) 2026 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @addtogroup nrf71_wifi_fw_if Wi-Fi driver and firmware interface
 * @{
 * @brief System interface between host and RPU
 */

#ifndef __NRF71_WIFI_COMMON_H__
#define __NRF71_WIFI_COMMON_H__

#include <common/fw_if/nrf71_wifi_rf.h>
#include <common/fw_if/pack_def.h>
#include <common/fw_if/nrf71_wifi_debug_stats.h>

#define NRF_WIFI_RF_PARAMS_CONF_SIZE 42

#define MAX_NUM_OF_RX_QUEUES 3
#define NRF_WIFI_MAX_SAP_CLIENTS 8
#define RPU_DATA_CMD_SIZE_MAX_RX 8

#define NRF_WIFI_RPU_PWR_DATA_TYPE_LFC_ERR 0
#define NRF_WIFI_RPU_PWR_DATA_TYPE_VBAT_MON 1
#define NRF_WIFI_RPU_PWR_DATA_TYPE_TEMP 2
#define NRF_WIFI_RPU_PWR_DATA_TYPE_ALL 3
#define NRF_WIFI_RPU_PWR_DATA_TYPE_MAX 4

#define NRF_WIFI_ETH_ADDR_LEN 6
#define NRF_WIFI_COUNTRY_CODE_LEN 2
#define MAX_TX_AGG_SIZE 16
#define MAX_RX_BUFS_PER_EVNT 64

#define AGGR_DISABLE 0
#define AGGR_ENABLE 1

#define NRF_WIFI_UMAC_VER(version) (((version)&0xFF000000) >> 24)
#define NRF_WIFI_UMAC_VER_MAJ(version) (((version)&0x00FF0000) >> 16)
#define NRF_WIFI_UMAC_VER_MIN(version) (((version)&0x0000FF00) >> 8)
#define NRF_WIFI_UMAC_VER_EXTRA(version) (((version)&0x000000FF) >> 0)


#define NRF_WIFI_LMAC_OFDM_SIFS_VALUE 1344
#define NRF_WIFI_LMAC_DSSS_SIFS_VALUE 768
#define NRF_WIFI_LMAC_PRE_CONNECTION_INACTIVITY_TIMER_VALUE 500000 /* 500ms */
#define NRF_WIFI_LMAC_RAW_TX_INACTIVITY_TIMER_VALUE 500 /* 500us */
#define NRF_WIFI_LMAC_BEACON_WAIT_TIME_VALUE 20000 /* 20ms */
#define NRF_WIFI_LMAC_ALLOWED_BCN_MISS_BEFORE_WAKEUP_VALUE 1 /* 1 beacon */
#define NRF_WIFI_LMAC_INACTIVITY_TIMER_AFTER_RX_VALUE 2000 /* 2ms */
#define NRF_WIFI_LMAC_BCST_WAIT_PERIOD_VALUE 20000 /* 20ms */
#define NRF_WIFI_LMAC_DATA_PATH_WATCH_DOG_TIMER_VALUE 600000 /* 600ms */
#define NRF_WIFI_LMAC_ACK_MARGIN_VALUE 128 /* in clock cycles*/

/**
 * @brief Common header included in each command/event.
 *
 * This structure encapsulates the common information included at the start of
 * each command/event exchanged with the RPU.
 */
struct host_rpu_msg_hdr {
	/** Length of the message. */
	unsigned int len;
	/** Flag to indicate whether the recipient is expected to resubmit
	 *  the cmd/event address back to the trasmitting entity.
	 */
	unsigned int resubmit;
} __NRF_WIFI_PKD;

/**
 * @brief This enum defines the different categories of messages that can be exchanged between
 *  the Host and the RPU.
 *
 */
enum nrf_wifi_host_rpu_msg_type {
	/** System interface messages */
	NRF_WIFI_HOST_RPU_MSG_TYPE_SYSTEM,
	/** Unused */
	NRF_WIFI_HOST_RPU_MSG_TYPE_SUPPLICANT,
	/** Data path messages */
	NRF_WIFI_HOST_RPU_MSG_TYPE_DATA,
	/** Control path messages */
	NRF_WIFI_HOST_RPU_MSG_TYPE_UMAC
};
/**
 * @brief This structure defines the common message header used to encapsulate each message
 *  exchanged between the Host and UMAC.
 *
 */

struct host_rpu_msg {
	/** Header */
	struct host_rpu_msg_hdr hdr;
	/** Type of the RPU message see &enum nrf_wifi_host_rpu_msg_type */
	signed int type;
	/** Actual message */
	signed char msg[0];
} __NRF_WIFI_PKD;

#define NRF_WIFI_PENDING_FRAMES_BITMAP_AC_VO (1 << 0)
#define NRF_WIFI_PENDING_FRAMES_BITMAP_AC_VI (1 << 1)
#define NRF_WIFI_PENDING_FRAMES_BITMAP_AC_BE (1 << 2)
#define NRF_WIFI_PENDING_FRAMES_BITMAP_AC_BK (1 << 3)

#define USE_PROTECTION_NONE 0
#define USE_PROTECTION_RTS 1
#define USE_PROTECTION_CTS2SELF 2

#define USE_SHORT_PREAMBLE 0
#define DONT_USE_SHORT_PREAMBLE 1

#define MARK_RATE_AS_MCS_INDEX 0x80
#define MARK_RATE_AS_RATE 0x00

#define ENABLE_GREEN_FIELD 0x01
#define ENABLE_CHNL_WIDTH_40MHZ 0x02
#define ENABLE_SGI 0x04
#define ENABLE_11N_FORMAT 0x08
#define ENABLE_VHT_FORMAT 0x10
#define ENABLE_CHNL_WIDTH_80MHZ 0x20

#define MAX_MGMT_BUFS 16

#define MAX_RF_CALIB_DATA 900

#define PHY_THRESHOLD_NORMAL (-65)
#define PHY_THRESHOLD_PROD_MODE (-93)

#define MAX_TX_STREAMS 1
#define MAX_RX_STREAMS 1

#define MAX_NUM_VIFS 2
#define MAX_NUM_STAS 2
#define MAX_NUM_APS 1

/**
 * @brief This enum provides a list of different operating modes.
 *
 */
enum rpu_op_mode {
	/** Radio test mode is used for performing radio tests using
	 *  continuous Tx/Rx on a configured channel at a particular rate or power.
	 */
	RPU_OP_MODE_RADIO_TEST,
	/** In this mode different types of calibration like RF calibration can be performed */
	RPU_OP_MODE_FCM,
	/** Regular mode of operation */
	RPU_OP_MODE_REG,
	/** Debug mode can be used to control certain parameters like TX rate
	 *  in order to debug functional issues.
	 */
	RPU_OP_MODE_DBG,
	/** Highest mode number currently defined */
	RPU_OP_MODE_MAX
};

/**
 * @brief- Throughput mode
 * Throughput mode to be used for transmitting the packet.
 */
enum rpu_tput_mode {
	/** Legacy mode */
	RPU_TPUT_MODE_LEGACY,
	/** High Throuput mode(11n) */
	RPU_TPUT_MODE_HT,
	/** Very hight throughput(11ac) */
	RPU_TPUT_MODE_VHT,
	/** HE SU mode */
	RPU_TPUT_MODE_HE_SU,
	/** HE ER SU mode */
	RPU_TPUT_MODE_HE_ER_SU,
	/** HE TB mode */
	RPU_TPUT_MODE_HE_TB,
	/** Highest throughput mode currently defined */
	RPU_TPUT_MODE_MAX
};

/**
 * @brief - System commands.
 *
 */
enum nrf_wifi_sys_commands {
	/** Command to initialize RPU and RPU responds with NRF_WIFI_EVENT_INIT_DONE */
	NRF_WIFI_CMD_INIT,
	/** command to send a Tx packet in radiotest mode */
	NRF_WIFI_CMD_TX,
	/** Unused */
	NRF_WIFI_CMD_IF_TYPE,
	/** command to specify mode of operation */
	NRF_WIFI_CMD_MODE,
	/** command to get statistics */
	NRF_WIFI_CMD_GET_STATS,
	/** command to clear statistics */
	NRF_WIFI_CMD_CLEAR_STATS,
	/** command to get debug statistics */
	NRF_WIFI_CMD_DEBUG_STATS,
	/** command to ENABLE/DISABLE receiving packets in radiotest mode */
	NRF_WIFI_CMD_RX,
	/** Command to measure battery voltage and RPU responds	with NRF_WIFI_EVENT_PWR_DATA */
	NRF_WIFI_CMD_PWR,
	/** RPU De-initialization */
	NRF_WIFI_CMD_DEINIT,
	/** Command for WIFI & SR coexistence */
	NRF_WIFI_CMD_SRCOEX,
	/** Command to start RF test */
	NRF_WIFI_CMD_RF_TEST,
	/** Configure HE_GI & HE_LTF */
	NRF_WIFI_CMD_HE_GI_LTF_CONFIG,
	/** Command for getting UMAC memory statistics */
	NRF_WIFI_CMD_UMAC_INT_STATS,
	/** Command for Setting the channel & Rf params in radiotest mode */
	NRF_WIFI_CMD_RADIO_TEST_INIT,
	/** Command for setting country in radiotest mode */
	NRF_WIFI_CMD_RT_REQ_SET_REG,
	/** Command to enable/disable fixed data rate in regular mode */
	NRF_WIFI_CMD_TX_FIX_DATA_RATE,
	/** Command to set channel in promiscuous, monitor  & packet injector mode */
	NRF_WIFI_CMD_CHANNEL,
	/** Command to configure promiscuous mode, Monitor mode & packet injector mode */
	NRF_WIFI_CMD_RAW_CONFIG_MODE,
	/** Command to configure promiscuous mode, Monitor mode filter*/
	NRF_WIFI_CMD_RAW_CONFIG_FILTER,
	/** Command to configure packet injector mode or Raw Tx mode */
	NRF_WIFI_CMD_RAW_TX_PKT,
	/** Command to reset interface statistics */
	NRF_WIFI_CMD_RESET_STATISTICS,
	/** Command to configure raw tx offloading parameters */
	NRF_WIFI_CMD_OFFLOAD_RAW_TX_PARAMS,
	/** Command to enable/disable raw tx offloading */
	NRF_WIFI_CMD_OFFLOAD_RAW_TX_CTRL,
	/** Configure SGI/LGI */
	NRF_WIFI_CMD_GI_CONFIG,
	/** Enable BCC OR LDPC */
	NRF_WIFI_CMD_CODING_TYPE_CONFIG,
	/** Command to program sqi */
	NRF_WIFI_UMAC_CMD_SQI_CONFIG,
	/** Update XO value */
	NRF_WIFI_CMD_UPDATE_XO,
	/** Command to configure LMAC tuning parameters */
	NRF_WIFI_CMD_LMAC_TUNING_PARAMS,
	/** Radio test: push full @ref rpu_conf_params (MAC/PHY update) to LMAC/PHY */
	NRF_WIFI_CMD_MAC_PARAM_UPDATE,
};

/**
 * @brief - Events from the RPU.
 *
 */
enum nrf_wifi_sys_events {
	/** Response to NRF_WIFI_CMD_PWR */
	NRF_WIFI_EVENT_PWR_DATA,
	/** Response to NRF_WIFI_CMD_INIT */
	NRF_WIFI_EVENT_INIT_DONE,
	/** Response to NRF_WIFI_CMD_GET_STATS */
	NRF_WIFI_EVENT_STATS,
	/** Response to NRF_WIFI_CMD_GET_DEBUG_STATS */
	NRF_WIFI_EVENT_DEBUG_STATS,
	/** Response to NRF_WIFI_CMD_DEINIT */
	NRF_WIFI_EVENT_DEINIT_DONE,
	/** Response to NRF_WIFI_CMD_RF_TEST */
	NRF_WIFI_EVENT_RF_TEST,
	/** Response to NRF_WIFI_CMD_SRCOEX. */
	NRF_WIFI_EVENT_COEX_CONFIG,
	/** Response to NRF_WIFI_CMD_UMAC_INT_STATS */
	NRF_WIFI_EVENT_INT_UMAC_STATS,
	/** Command status events for radio test commands*/
	NRF_WIFI_EVENT_RADIOCMD_STATUS,
	/** Response to NRF_WIFI_CMD_CHANNEL */
	NRF_WIFI_EVENT_CHANNEL_SET_DONE,
	/** Response to NRF_WIFI_CMD_RAW_CONFIG_MODE */
	NRF_WIFI_EVENT_MODE_SET_DONE,
	/** Response to NRF_WIFI_CMD_RAW_CONFIG_FILTER */
	NRF_WIFI_EVENT_FILTER_SET_DONE,
	/** Tx done event for the Raw Tx */
	NRF_WIFI_EVENT_RAW_TX_DONE,
	/** Command status events for offloaded raw tx commands */
	NRF_WIFI_EVENT_OFFLOADED_RAWTX_STATUS,
	/** Error status to Host*/
	NRF_WIFI_EVENT_ERROR_STATS,
};

/**
 * @brief - Channel Bandwidth types.
 *
 */
enum rpu_ch_bw {
	/** 20MHz bandwidth */
	RPU_CH_BW_20,
	/** 40MHz bandwidth */
	RPU_CH_BW_40,
	/** 80MHz bandwidth */
	RPU_CH_BW_MAX
};

/**
 * @brief - This structure specifies the parameters required to configure a specific channel.
 *
 */
struct chan_params {
	/** Operating band bitmap values: NRF_WIFI_OP_BAND_2GHZ,
	 * NRF_WIFI_OP_BAND_5GHZ, NRF_WIFI_OP_BAND_6GHZ
	 */
	unsigned char op_band;
	/** Primary channel number */
	unsigned int primary_num;
	/** Channel bandwidth */
	unsigned char bw;
	/** 20Mhz offset value */
	signed int sec_20_offset;
	/** 40Mhz offset value */
	signed int sec_40_offset;
} __NRF_WIFI_PKD;

/**
 * @brief This structure specifies the parameters required to start or stop the RX (receive)
 *  operation in radiotest mode.
 *
 */
struct rpu_conf_rx_radio_test_params {
	/** Number of spatial streams supported. Currently unused. */
	unsigned char nss;
	/** An array containing RF and baseband control params */
	struct chan_params chan;
	/** Copy OTP params to this memory */
	signed char phy_threshold;
	/** Calibration bit map value. See nrf71_wifi_rf.h NRF_WIFI_DEF_PHY_CALIB.
	 */
	unsigned int phy_calib;
	/** Start Rx : 1, Stop Rx :0 */
	unsigned char rx;
} __NRF_WIFI_PKD;

/**
 * @brief The UMAC header structure for system commands and events defines the format
 *  used to transmit and receive system-level commands and events.
 *
 */
struct nrf_wifi_sys_head {
	/** Command/Event id */
	unsigned int cmd_event;
	/** message length */
	unsigned int len;
} __NRF_WIFI_PKD;

/** Feature Disable */
#define NRF_WIFI_FEATURE_DISABLE 0
/** Feature Enable */
#define NRF_WIFI_FEATURE_ENABLE 1

/**
 * @brief The maximum Rx (receive) A-MPDU size in KB.
 *
 */
enum max_rx_ampdu_size {
	/** 8KB AMPDU Size */
	MAX_RX_AMPDU_SIZE_8KB,
	/** 16KB AMPDU Size */
	MAX_RX_AMPDU_SIZE_16KB,
	/** 32KB AMPDU Size */
	MAX_RX_AMPDU_SIZE_32KB,
	/** 64KB AMPDU Size */
	MAX_RX_AMPDU_SIZE_64KB
};

/**
 * @brief This structure defines the parameters used to control the transmit (TX) power.
 *
 */
struct nrf_wifi_tx_pwr_ctrl_params {
	/** Antenna gain for 2.4 GHz band */
	unsigned char ant_gain_2g;
	/** Antenna gain for 5 GHz band (5150 MHz - 5350 MHz) */
	unsigned char ant_gain_5g_band1;
	/** Antenna gain for 5 GHz band (5470 MHz - 5730 MHz) */
	unsigned char ant_gain_5g_band2;
	/** Antenna gain for 5 GHz band (5730 MHz - 5895 MHz) */
	unsigned char ant_gain_5g_band3;
	/** Antenna gain for 6 GHz band (5935 MHz - 6015 MHz) */
	unsigned char ant_gain_6g_band1;
	/** Antenna gain for 6 GHz band (6035 MHz - 6115 MHz) */
	unsigned char ant_gain_6g_band2;
	/** Antenna gain for 6 GHz band (6135 MHz - 6215 MHz) */
	unsigned char ant_gain_6g_band3;
	/** Antenna gain for 6 GHz band (6235 MHz - 6315 MHz) */
	unsigned char ant_gain_6g_band4;
	/** Antenna gain for 6 GHz band (6335 MHz - 6415 MHz) */
	unsigned char ant_gain_6g_band5;
	/** Antenna gain for 6 GHz band (6435 MHz - 6475 MHz) */
	unsigned char ant_gain_6g_band6;
} __NRF_WIFI_PKD;

/**
 * @brief This structure specifies the configuration parameters used for configuring
 *  data-related settings.
 *
 */

struct nrf_wifi_data_config_params {
	/** rate_protection_type:0->NONE, 1->RTS/CTS, 2->CTS2SELF */
	unsigned char rate_protection_type;
	/** Aggregation is enabled(NRF_WIFI_FEATURE_ENABLE) or
	 *  disabled(NRF_WIFI_FEATURE_DISABLE)
	 */
	unsigned char aggregation;
	/** WMM is enabled(NRF_WIFI_FEATURE_ENABLE) or
	 *  disabled(NRF_WIFI_FEATURE_DISABLE)
	 */
	unsigned char wmm;
	/** Max number of aggregated TX sessions */
	unsigned char max_num_tx_agg_sessions;
	/** Max number of aggregated RX sessions */
	unsigned char max_num_rx_agg_sessions;
	/** maximum aggregation size */
	unsigned char max_tx_aggregation;
	/** Reorder buffer size (1 to 64) */
	unsigned char reorder_buf_size;
	/** Max RX AMPDU size (8/16/32/64 KB), see &enum max_rx_ampdu_size */
	signed int max_rxampdu_size;
} __NRF_WIFI_PKD;

/**
 * @brief This structure specifies the parameters that need to be provided for the command
 * NRF_WIFI_CMD_INIT for all modes. The NRF_WIFI_CMD_INIT command is typically used to
 * initialize the Wi-Fi module and prepare it for further communication.
 *
 */
struct nrf_wifi_sys_params {
	/** enable rpu sleep */
	unsigned int sleep_enable;
	/** Normal/FTM mode */
	unsigned int hw_bringup_time;
	/** Antenna Configuration, applicable only for 1x1 */
	unsigned int sw_bringup_time;
	/** Internal tuning parameter */
	unsigned int bcn_time_out;
	/** Set to 1 if rpu is expected to perform sleep clock calibration */
	unsigned int calib_sleep_clk;
	/** calib bit map value. See nrf71_wifi_rf.h NRF_WIFI_DEF_PHY_CALIB */
	unsigned int phy_calib;
	/** MAC address of the interface. Not applicable to Radio Test mode */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** VTF buffer address */
	unsigned int vtf_buffer_addr;
	/** An array containing RF & baseband control params */
	unsigned int rf_params_addr[NUM_WIFI_PARAMS];
	/** Transmit power control parameters */
	struct nrf_wifi_tx_pwr_ctrl_params tx_pwr_ctrl_params;
} __NRF_WIFI_PKD;

/**
 * @brief This enum defines different types of operating bands in 6G
 * Inband scanning.
 */
enum scan_type_6g {
	/** Active scan : PSC channels scanning */
	ACTIVE_PSC,
	/** Passive scan : Unsolicited probe responses*/
	UNSOLIC_PROBE_RESPONSE,
	/** Passive scan : Fast Initial Link Setup Frames */
	FILS
};

/** operating bands bitmap values */
#define NRF_WIFI_OP_BAND_2GHZ	(1 << 0)
#define NRF_WIFI_OP_BAND_5GHZ	(1 << 1)
#define NRF_WIFI_OP_BAND_6GHZ	(1 << 2)


/**
 * @brief This enum defines keep alive state
 *
 */
enum nrf_wifi_keep_alive_status {
	/** Keep alive feature disabled */
	KEEP_ALIVE_DISABLED = 0,
	/** Keep alive feature enabled */
	KEEP_ALIVE_ENABLED = 1
};

/**
 * @brief This enum specifies the type of frames used to retrieve buffered data
 *  from the AP in power save mode.
 */
enum ps_exit_strategy {
	/** Uses an intelligent algo and decide whether to
	 * stay or exit power save mode to receive buffered frames.
	 */
	INT_PS = 0,
	/** Exits power save mode for every TIM */
	EVERY_TIM
};

