nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_common.h
struct rx_buf_pool_params {
	unsigned short buf_sz;
	unsigned short num_bufs;
} __NRF_WIFI_PKD;

struct temp_vbat_config {
	unsigned int temp_based_calib_en;
	unsigned int temp_calib_bitmap;
	unsigned int vbat_calibp_bitmap;
	unsigned int temp_vbat_mon_period;
	int vth_very_low;
	int vth_low;
	int vth_hi;
	int temp_threshold;
	int vbat_threshold;
} __NRF_WIFI_PKD;

#define TWT_EXTEND_SP_EDCA  0x1
#define DISABLE_DFS_CHANNELS 0x2

#define NRF_WIFI_FTM_INITIATOR_ENABLE (1 << 0)
#define NRF_WIFI_FTM_RESPONDER_ENABLE (1 << 1)
#define NRF_WIFI_LCI_ENABLE (1 << 2)
#define NRF_WIFI_CIVILOC_ENABLE (1 << 3)
#define NRF_WIFI_GAS_ENABLE (1 << 4)

struct nrf_wifi_ftm_loc_params {
	/** Enable = 1, Disable=0 */
	unsigned char ftm_enable;
	/** Capabilities NRF_WIFI_FTM_INITIATOR_ENABLE & etc */
	unsigned char capabilities;
};

#define NRF_WIFI_LDPC_ENABLE_HT  (1 << 0)
#define NRF_WIFI_LDPC_ENABLE_VHT (1 << 1)
/**
 * @brief This structure defines the command responsible for initializing the UMAC.
 *  After the host driver brings up, the host sends NRF_WIFI_CMD_INIT to the RPU.
 *  The RPU then performs the initialization and responds with NRF_WIFI_EVENT_INIT_DONE
 *  once the initialization is completed.
 *
 */

struct nrf_wifi_cmd_sys_init {
	/** umac header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** id of the interface */
	unsigned int wdev_id;
	/** @ref nrf_wifi_sys_params */
	struct nrf_wifi_sys_params sys_params;
	/** LMAC Rx buffs pool params, @ref rx_buf_pool_params */
	struct rx_buf_pool_params rx_buf_pools[MAX_NUM_OF_RX_QUEUES];
	/** Data configuration params, @ref nrf_wifi_data_config_params */
	struct nrf_wifi_data_config_params data_config_params;
	/** Temperature and battery voltage calibration */
	struct temp_vbat_config temp_vbat_config_params;
	/** Country code to set */
	unsigned char country_code[NRF_WIFI_COUNTRY_CODE_LEN];
	/** Operating band bitmap values: NRF_WIFI_OP_BAND_2GHZ,
	 * NRF_WIFI_OP_BAND_5GHZ, NRF_WIFI_OP_BAND_6GHZ
	 */
	unsigned char op_band;
	/** Offload mgmt buffer refill to UMAC when enabled */
	unsigned char mgmt_buff_offload;
	/** Enable features from driver config */
	unsigned int feature_flags;
	/** To deactivate beamforming,
	 * By default the RPU enables the beamforming feature.
	 *  If a user wishes to turn it off, they should set this parameter to 1.
	 */
	unsigned int disable_beamforming;
	/** The RPU uses this value (in seconds) to decide how long to wait
	 *  without receiving beacons before disconnection.
	 */
	unsigned int discon_timeout;
	/** RPU uses QoS null frame or PS-Poll frame to retrieve buffered frames
	 * from the AP in power save
	 */
	unsigned char ps_exit_strategy;
	/** The RPU uses this value to configure watchdog timer */
	unsigned int watchdog_timer_val;
	/** The RPU uses this value to decide whether keep alive
	 *  feature is enabled or not.
	 */
	unsigned char keep_alive_enable;
	/** The RPU uses this value(in seconds) for periodicity of the keep
	 *  alive frame.
	 */
	unsigned int keep_alive_period;
	/** The RPU uses this value to define the limit on display scan BSS entries.
	 *  By default, the limit is set to 250 in scan-only mode and 150 in regular mode.
	 *  If this value is greater than 0, it overrides the default limits.
	 */
	unsigned int display_scan_bss_limit;
	/** The RPU uses this value to enable/disable priority window for Wi-Fi scan
	 *  in the case of coexistence with Short Range radio.
	 */
	unsigned int coex_disable_ptiwin_for_wifi_scan;
	/** The RPU uses this value to enable : 1 or disable : 0 the transmission of
	 *  beacon and probe responses to the host when mgmt buffer offloading is enabled.
	 */
	unsigned char raw_scan_enable;
	/** The RPU uses this value for the number of PS-POLL failures
	 *  to switch from ps-poll power save mode to QoS null-based
	 *  power save mode.
	 *  MIN: 10 (default), MAX: 0xfffffffe.
	 *  Set to 0xffffffff to disable this feature.
	 */
	unsigned int max_ps_poll_fail_cnt;
	/** Enables or disables RX STBC in HT mode.
	 *  By default, RX STBC is enabled.
	 */
	unsigned int stbc_enable_in_ht;
	/* Enables(1) or Disables(0) Dynamic bandwidth signalling control */
	unsigned int dbs_war_ctrl;
	/* Enables(1) or Disables(0) Dynamic ED*/
	unsigned int dynamic_ed;
	/** The RPU uses this value to enable/disable priority window for Wi-Fi scan
	 *  in the case of coexistence with Short Range radio.
	 */
	unsigned int inband_scan_type;
	/** 0:umac checksum disable 1: umac checksum enable */
	unsigned char tcp_ip_checksum_offload;
	/** @ref nrf_wifi_ftm_loc_params */
	struct nrf_wifi_ftm_loc_params ftm_loc_params;
	/** Bit 0 : LDPC in HT mode. Use NRF_WIFI_LDPC_ENABLE_HT
	 *  Bit 1 : LDPC in VHT mode. Use NRF_WIFI_LDPC_ENABLE_VHT
	 */
	unsigned char ldpc_config;
	/** Protocol mode bitmap for registration. Use NRF_WIFI_802_11G,
	 *  NRF_WIFI_802_11N, NRF_WIFI_802_11AC, NRF_WIFI_802_11AX from nrf71_wifi_ctrl.h.
	 *  Zero = all supported. Otherwise only the set bits are advertised (e.g. 11G only,
	 *  or 11G|11N, or 11G|11N|11AC, or 11G|11N|11AC|11AX).
	 *  11AC implies 11N; 11AX implies 11AC+11N.
	 */
	unsigned int protocol_mode;
	/** Display scan behaviour once @ref display_scan_bss_limit slots are filled
	 *  (and host scan DB size / fallback caps apply in the UMAC).
	 *  0 (default): keep scanning; a strictly stronger RSSI than the weakest stored
	 *               BSS replaces that weakest entry (list stays signal-ranked).
	 *  1: at capacity, further qualifying beacons/probes trigger scan abort to the
	 *     lower layer and scan completion to the upper layer; no RSSI replacement.
	 */
	unsigned char display_scan_abort_on_bss_limit;
	/** Flag to prevent fallback from 802.11ac to lower Wi-Fi modes */
	unsigned char nrf_wifi_11ac_downgrade_disable;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to de-initialize the RPU.
 *
 */

struct nrf_wifi_cmd_sys_deinit {
	/** umac header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
} __NRF_WIFI_PKD;

#define NRF_WIFI_HE_GI_800NS 0
#define NRF_WIFI_HE_GI_1600NS 1
#define NRF_WIFI_HE_GI_3200NS 2

