nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_common.h
#define NRF_WIFI_HE_LTF_3200NS 0
#define NRF_WIFI_HE_LTF_6400NS 1
#define NRF_WIFI_HE_LTF_12800NS 2

/**
 * @brief This structure defines the command used to configure
 *  High-Efficiency Guard Interval(HE-GI) and High-Efficiency Long Training Field (HE-LTF).
 *
 *  HE-GI duration determines the guard interval length used in the HE transmission.
 *  HE-LTF is used for channel estimation and signal detection in HE transmissions.
 *
 */

struct nrf_wifi_cmd_he_gi_ltf_config {
	/** umac header, see &nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** wdev interface id */
	unsigned char wdev_id;
	/** HE GI type (NRF_WIFI_HE_GI_800NS/NRF_WIFI_HE_GI_1600NS/NRF_WIFI_HE_GI_3200NS) */
	unsigned char he_gi_type;
	/** HE LTF (NRF_WIFI_HE_LTF_3200NS/NRF_WIFI_HE_LTF_6400NS/NRF_WIFI_HE_LTF_12800NS) */
	unsigned char he_ltf;
	/** Fixed HE GI & LTF values can be enabled and disabled */
	unsigned char enable;
} __NRF_WIFI_PKD;

#define		NRF_WIFI_DISABLE	0
#define		NRF_WIFI_ENABLE		1
/**
 * @brief This enum represents the different types of preambles used.
 *  Preambles are sequences of known symbols transmitted before the actual
 *  data transmission to enable synchronization, channel estimation, and
 *  frame detection at the receiver.
 *
 */
enum rpu_pkt_preamble {
	/** Short preamble packet */
	RPU_PKT_PREAMBLE_SHORT,
	/** Long preamble packet */
	RPU_PKT_PREAMBLE_LONG,
	/** mixed preamble packet */
	RPU_PKT_PREAMBLE_MIXED,
	/** Highest preamble type currently defined */
	RPU_PKT_PREAMBLE_MAX,
};

struct nrf_wifi_cmd_mode {
	struct nrf_wifi_sys_head sys_head;
	signed int mode;

} __NRF_WIFI_PKD;
/**
 * @brief This structure describes different Physical Layer (PHY) configuration parameters used
 *  in RF test and Radio test scenarios. These parameters are specific to testing and evaluating
 *  the performance of the radio hardware.
 *
 */
struct rpu_conf_params {
	/** Unused. Number of spatial streams supported. Support is there for 1x1 only. */
	unsigned char nss;
	/** Unused */
	unsigned char antenna_sel;
	/** Not required */
	unsigned char tx_pkt_chnl_bw;
	/** WLAN packet formats. 0->Legacy 1->HT 2->VHT 3->HE(SU) 4->HE(ERSU) and 5->HE(TB) */
	unsigned char tx_pkt_tput_mode;
	/** Short Guard enable/disable */
	unsigned char tx_pkt_sgi;
	/** Not required */
	unsigned char tx_pkt_nss;
	/** Preamble type. 0->short, 1->Long and 2->Mixed */
	unsigned char tx_pkt_preamble;
	/** Not used */
	unsigned char tx_pkt_stbc;
	/** 0->BCC 1->LDPC. Supporting only BCC in nRF7002 */
	unsigned char tx_pkt_fec_coding;
	/** Valid MCS number between 0 to 7 */
	signed char tx_pkt_mcs;
	/** Legacy rate to be used in Mbps (1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48, 54) */
	signed char tx_pkt_rate;
	/** Copy OTP params to this memory */
	signed char phy_threshold;
	/** Calibration bit map value. refer NRF_WIFI_DEF_PHY_CALIB */
	unsigned int phy_calib;
	/** Radio test mode or System mode selection */
	signed int op_mode;
	/** Channel related info viz, channel, bandwidth, primary 20 offset */
	struct chan_params chan;
	/** Value of 0 means continuous transmission.Greater than 1 is invalid */
	unsigned char tx_mode;
	/** Number of packets to be transmitted. Any number above 0.
	 *  Set -1 for continuous transmission
	 */
	signed int tx_pkt_num;
	/** Length of the packet (in bytes) to be transmitted */
	unsigned short tx_pkt_len;
	/** Desired TX power in dBm in the range 0 dBm to 21 dBm in steps of 1 dBm */
	unsigned int tx_power;
	/** Transmit WLAN packet */
	unsigned char tx;
	/** Receive WLAN packet */
	unsigned char rx;
	/**  Not required */
	unsigned char aux_adc_input_chain_id;
	/**  Unused */
	unsigned char agg;
	/** Select HE LTF type viz, 0->1x, 1->2x and 2->4x */
	unsigned char he_ltf;
	/** Select HE LTF type viz, 0->0.8us, 1->1.6us and 2->3.2us */
	unsigned char he_gi;
	/** Not required */
	unsigned char set_he_ltf_gi;
	/** Not required */
	unsigned char power_save;
	/** Not required */
	unsigned int rts_threshold;
	/** Not required */
	unsigned int uapsd_queue;
	/** Interval between TX packets in us (Min: 200, Max: 200000, Default: 200) */
	unsigned int tx_pkt_gap_us;
	/** Configure WLAN antenna switch(0-separate/1-shared) */
	unsigned char wlan_ant_switch_ctrl;
	/** Switch to control the SR antenna or shared WiFi antenna */
	unsigned char sr_ant_switch_ctrl;
	/** Resource unit (RU) size (26,52,106 or 242) */
	unsigned char ru_tone;
	/** Location of resource unit (RU) in 20 MHz spectrum */
	unsigned char ru_index;
	/** Desired tone frequency to be transmitted */
	signed char tx_tone_freq;
	/** Tone type to be transmitted (0=complex, 1=real-only, 2=imag-only) */
	unsigned char tx_tone_type;
	/** DC offset for I channel (Q.11 format) */
	signed short int tx_tone_dc_offset_i;
	/** DC offset for Q channel (Q.11 format) */
	signed short int tx_tone_dc_offset_q;
	/** RX LNA gain */
	unsigned char lna_gain;
	/** RX BB gain */
	unsigned char bb_gain;
	/** Number of RX samples to be captured */
	unsigned short int capture_length;
	/** Capture timeout in seconds */
	unsigned short int capture_timeout;
	/** ED threshold for OFDM dynamic capture (stored as 8-bit signed value) */
	unsigned char ed_thresh_ofdm;
	/** ED threshold for DSSS dynamic capture (stored as 8-bit signed value) */
	unsigned char ed_thresh_dsss;
	/** Configure WLAN to bypass regulatory */
	unsigned char bypass_regulatory;
	/** Two letter country code (00: Default for WORLD) */
	unsigned char country_code[NRF_WIFI_COUNTRY_CODE_LEN];
	/** Contention window value to be configured */
	unsigned int tx_pkt_cw;
	unsigned int rx_bss_color;
	unsigned int rx_station_id;
	/** TX DCM enable. Valid values: 0 (disabled), 1 (enabled) */
	unsigned char tx_dcm;
	/** TX Doppler enable. Valid values: 0 (disabled), 1 (enabled) */
	unsigned char tx_doppler;
	/** TX midamble periodicity. Valid values: 10, 20 */
	unsigned char tx_midamble_periodicity;
	/** TX 106-tone RU enable. Valid values: 0 (disabled), 1 (enabled) */
	unsigned char tx_106_tone;
	/** TX legacy length field (in octets). Valid range: 0-4095 */
	unsigned short tx_legacy_length;
	/** TX FEC padding factor. Valid values: 1, 2, 3, 4 */
	unsigned char tx_fec_padd_factor;
	/** Informs number of HE-LTFs: 0->1x, 1->2x, 2->4x, 3->6x, 4->8x */
	unsigned char tx_num_he_ltf;
	/** An array containing RF & baseband control params */
	unsigned int rf_params_addr[NUM_WIFI_PARAMS];
	/** VTF buffer address */
	unsigned int vtf_buffer_addr;
	/** BSS check in RX filter: 0=disable, 1=enable */
	unsigned char bss_check_enable;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to configure the RPU with different
 *  PHY configuration parameters specifically designed for RF test and Radio test scenarios.
 *  The command is intended to set up the RPU for testing and evaluating the performance
 *  of the radio hardware.
 *
 */

struct nrf_wifi_cmd_mode_params {
	/** UMAC header, See &struct nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** configuration parameters of different modes see &union rpu_conf_params */
	struct rpu_conf_params conf;
	/** Packet length */
	unsigned short pkt_length[MAX_TX_AGG_SIZE];
	/** Packet ddr pointer */
	unsigned int ddr_ptrs[MAX_TX_AGG_SIZE];
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the parameters required to initialize a radio test.
 *
 */
struct nrf_wifi_radio_test_init_info {
	/** An array containing RF & baseband control params */
	unsigned int rf_params_addr[NUM_WIFI_PARAMS];
	/** Transmit power control parameters */
	struct nrf_wifi_tx_pwr_ctrl_params tx_pwr_ctrl_params;
	/** VTF buffer address */
	unsigned int vtf_buffer_addr;
	/** Channel related info viz, channel, bandwidth, primary 20 offset */
	struct chan_params chan;
	/** Phy threshold value to be sent to LMAC in channel programming */
	signed char phy_threshold;
	/** Calibration bit map value. See nrf71_wifi_rf.h NRF_WIFI_DEF_PHY_CALIB */
	unsigned int phy_calib;
	/** Receive BSS color value (1 to 63) */
	unsigned char rx_bss_color;
	/** Receive station ID value (1 to 2047) */
	unsigned short rx_station_id;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to initialize a radio test.
 *
 */
struct nrf_wifi_cmd_radio_test_init {
	/** UMAC header, @ref nrf_wifi_sys_head*/
	struct nrf_wifi_sys_head sys_head;
	/** radiotest init configuration parameters @ref nrf_wifi_radio_test_init_info */
	struct nrf_wifi_radio_test_init_info conf;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to enable or disable the reception (Rx).
 *  It allows controlling the radio hardware's receive functionality to start or stop listening
 *  for incoming data frames.
 */

struct nrf_wifi_cmd_rx {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** rx configuration parameters @ref rpu_conf_rx_radio_test_params */
	struct rpu_conf_rx_radio_test_params conf;
} __NRF_WIFI_PKD;

/**
 * @brief Radio test command for MAC/PHY update using the full set
 *  of @ref rpu_conf_params (see LMAC_CMD_CONFIG_MAC_PARAMS).
 */
struct nrf_wifi_cmd_mac_param_update {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Full radio-test configuration @ref rpu_conf_params */
	struct rpu_conf_params conf;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to retrieve statistics from the RPU.
 *
 */
struct nrf_wifi_cmd_get_stats {
	/** UMAC header, @ref nrf_wifi_sys_head*/
	struct nrf_wifi_sys_head sys_head;
	/** Statistics type &enum rpu_stats_type */
	signed int stats_type;
	/** Production mode or FCM mode */
	signed int op_mode;
} __NRF_WIFI_PKD;


/**
 * @brief This structure defines the command used to retrieve statistics from the RPU.
 *
 */
struct nrf_wifi_umac_cmd_debug_stats {
	/** UMAC header, @ref nrf_wifi_sys_head*/
	struct nrf_wifi_sys_head sys_head;

