nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_common.h
	/** Statistics type &enum rpu_stats_type */
	signed int stats_type;
	/**
	 * Control to enable/disable periodic stats
	 * 0 - Periodic stats will be disabled
	 * non zero - Number of times Periodic stats will be sent.
	 */
	unsigned int periodic_stats_enable;
	unsigned int periodic_stats_interval; /* in seconds */
	/**Stats control in Bitmap */
	unsigned int stats_ctrl;
	/**Stats GDRAM Address */
	unsigned int stats_addr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the event used to send statistics to the Host.
 *
 */
struct nrf_wifi_umac_event_debug_stats {
	/** UMAC header, @ref nrf_wifi_sys_head*/
	struct nrf_wifi_sys_head sys_head;
	/** Statistics type &enum rpu_stats_type */
	signed int stats_type;
	/**Stats GDRAM Address */
	unsigned int stats_addr;
	/**Copy struct lmac_debug_stats OR struct umac_debug_stats OR
	 * struct phy_debug_stats to into struct nrf_wifi_rpu_debug_stats
	 */
	struct nrf_wifi_rpu_debug_stats stats;
} __NRF_WIFI_PKD;


enum umac_fail_events {
	UMAC_MEM_ALLOC_FAIL = 0,
};

enum lmac_fail_events {
	RX_INT_MEM_UNDERRUN = 0,
	DATA_PATH_STUCK,
	WIFI_REQ_TO_PTA_FAIL,
	HW_DATA_PATH_DEACTIVATE_FAIL,
	HW_DATA_PATH_ACTIVATE_FAIL,
	CAPTURE_DMA_NOT_FINISHING,
	FEED_DMA_NOT_FINISHING,
	RF_PLL_RECOVERY_FAILED,
	DEVICE_IS_ACTIVE_FOR_TOO_LONG
};

/**
 * @brief This structure defines the event used to send error statistics to the Host.
 *
 */
struct nrf_wifi_umac_event_error_stats {
	/** UMAC header, @ref nrf_wifi_sys_head*/
	struct nrf_wifi_sys_head sys_head;
	/** Statistics type &enum rpu_stats_type */
	signed int stats_type;
	/** Error code, see &enum lmac_fail_events or &enum umac_fail_events */
	unsigned int status_code;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the channel parameters to configure specific channel.
 *
 */
struct nrf_wifi_cmd_set_channel {
	/** UMAC header, @ref nrf_wifi_sys_head. */
	struct nrf_wifi_sys_head sys_head;
	/** Interface index. */
	unsigned char if_index;
	/** channel parameters, @ref chan_params. */
	struct chan_params chan;
} __NRF_WIFI_PKD;

/**
 * @brief This enum represents different types of filters used.
 */

enum wifi_packet_filter {
	/** Support management, data and control packet sniffing. */
	NRF_WIFI_PACKET_FILTER_ALL = 0x1,
	/** Support only sniffing of management packets. */
	NRF_WIFI_PACKET_FILTER_MGMT = 0x2,
	/** Support only sniffing of data packets. */
	NRF_WIFI_PACKET_FILTER_DATA = 0x4,
	/** Support only sniffing of control packets. */
	NRF_WIFI_PACKET_FILTER_CTRL = 0x8,
};

/**
 * @brief This structure defines the command used to configure
 *  promiscuous mode/Monitor mode/Packet injector mode.
 */
struct nrf_wifi_cmd_raw_config_mode {
	/** UMAC header, @ref nrf_wifi_sys_head. */
	struct nrf_wifi_sys_head sys_head;
	/** Interface index. */
	unsigned char if_index;
	/** Wireless device operating mode. */
	unsigned char op_mode;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to configure
 *  filters and capture length in promiscuous and monitor modes.
 */
struct nrf_wifi_cmd_raw_config_filter {
	/** UMAC header, @ref nrf_wifi_sys_head. */
	struct nrf_wifi_sys_head sys_head;
	/** Interface index. */
	unsigned char if_index;
	/** Wireless device operating mode filters for Promiscuous/Monitor modes. */
	unsigned char filter;
	/** capture length. */
	unsigned short capture_len;
} __NRF_WIFI_PKD;

/**
 * @brief This enum represents the queues used to segregate the TX frames depending on
 * their QoS categories. A separate queue is used for Beacon frames / frames
 * transmitted during DTIM intervals.
 */

enum UMAC_QUEUE_NUM {
	/** Queue for frames belonging to the "Background" Access Category. */
	UMAC_AC_BK = 0,
	/** Queue for frames belonging to the "Best-Effort" Access Category. */
	UMAC_AC_BE,
	/** Queue for frames belonging to the "Video" Access Category. */
	UMAC_AC_VI,
	/** Queue for frames belonging to the "Voice" Access Category. */
	UMAC_AC_VO,
	/** Queue for frames belonging to the "Beacon" Access Category. */
	UMAC_AC_BCN,
	/** Maximum number of transmit queues supported. */
	UMAC_AC_MAX_CNT
};

/**
 * @brief This structure defines the raw tx parameters used in packet injector mode.
 *
 */
struct nrf_wifi_raw_tx_pkt {
	/** Queue number will be BK, BE, VI, VO and BCN refer UMAC_QUEUE_NUM. */
	unsigned char queue_num;
	/** Descriptor identifier or token identifier. */
	unsigned char desc_num;
	/** Number of times a packet should be transmitted at each possible rate. */
	unsigned char rate_retries;
	/** refer see &enum rpu_tput_mode. */
	unsigned char rate_flags;
	/** rate: legacy rates: 1,2,55,11,6,9,12,18,24,36,48,54
	 *		  11N VHT HE  : MCS index 0 to 7.
	 **/
	unsigned char rate;

	/** AGGR_DISABLE(0)/AGGR_ENABLE(1) */
	unsigned char aggregation;
	/** Number of frames in this command */
	unsigned char num_frames;
	/** Packet lengths of frames */
	unsigned short pkt_length[MAX_TX_AGG_SIZE];
	/** Starting Physical address of each frame in Ext-RAM after dma_mapping */
	unsigned int frame_ddr_pointer[MAX_TX_AGG_SIZE];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to configure packet injector mode.
 *
 */
struct nrf_wifi_cmd_raw_tx {
	/** UMAC header, @ref nrf_wifi_sys_head. */
	struct nrf_wifi_sys_head sys_head;
	/** Interface index. */
	unsigned char if_index;
	/** Raw tx packet information. */
	struct nrf_wifi_raw_tx_pkt raw_tx_info;
} __NRF_WIFI_PKD;

/**
 * @brief This enum provides a list of different raw tx offloading types.
 */
enum nrf_wifi_offload_rawtx_ctrl_type {
	NRF_WIFI_OFFLOAD_TX_STOP,
	NRF_WIFI_OFFLOAD_TX_START,
	NRF_WIFI_OFFLOAD_TX_CONFIG,
};

/**
 * @brief This structure defines the offloaded raw tx control information.
 *
 */
struct nrf_wifi_offload_ctrl_params {
	/** Time interval in micro seconds */
	unsigned int period_in_us;
	/** Transmit power in dBm ( 0 to 20) */
	int tx_pwr;
	/** Channel number */
	struct chan_params chan;
} __NRF_WIFI_PKD;

#define NRF_WIFI_ENABLE_HE_SU 0x40
#define NRF_WIFI_ENABLE_HE_ER_SU 0x80

/**
 * @brief This structure defines the offloading raw tx parameters
 *
 */
struct nrf_wifi_offload_tx_ctrl {
	/** Packet lengths of frames, min 26 bytes and max 600 bytes */
	unsigned int pkt_length;
	/** Rate preamble type (USE_SHORT_PREAMBLE/DONT_USE_SHORT_PREAMBLE) */
	unsigned int rate_preamble_type;
	/** Number of times a packet should be transmitted at each possible rate */
	unsigned int rate_retries;
	/** Rate: legacy rates: 1,2,55,11,6,9,12,18,24,36,48,54
	 * 11N VHT HE: MCS index 0 to 7.
	 */
	unsigned int rate;
	/** Refer see &enum rpu_tput_mode */
	unsigned int rate_flags;
	/** HE GI type (NRF_WIFI_HE_GI_800NS/NRF_WIFI_HE_GI_1600NS/NRF_WIFI_HE_GI_3200NS) */
	unsigned char he_gi_type;
	/** HE LTF (NRF_WIFI_HE_LTF_3200NS/NRF_WIFI_HE_LTF_6400NS/NRF_WIFI_HE_LTF_12800NS) */
	unsigned char he_ltf;
	/** Payload pointer */
	unsigned int pkt_ram_ptr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used for  offloading Raw tx
 *
 */
struct nrf_wifi_cmd_offload_raw_tx_params {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Id of the interface */
	unsigned int wdev_id;
	/** Offloaded raw tx control information, @ref nrf_wifi_offload_ctrl_params */
	struct nrf_wifi_offload_ctrl_params ctrl_info;
	/** Offloaded raw tx params, @ref nrf_wifi_offload_tx_ctrl */
	struct nrf_wifi_offload_tx_ctrl tx_params;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used for  offloading Raw tx
 *
 */
struct nrf_wifi_cmd_offload_raw_tx_ctrl {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Id of the interface */
	unsigned int wdev_id;
	/** Offloading type @ref nrf_wifi_offload_rawtx_ctrl_type */
	unsigned char ctrl_type;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines an event that indicates set channel command done.
 *
 */
struct nrf_wifi_event_set_channel {
	/** UMAC header, @ref nrf_wifi_sys_head. */
	struct nrf_wifi_sys_head sys_head;
	/** Interface index. */
	unsigned char if_index;
	/** channel number. */
	struct chan_params chan;
	/** status of the set channel command, success(0)/Fail(-1). */
	int status;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines an event that indicates set raw config
 * mode command done.
 *
 */
struct nrf_wifi_event_raw_config_mode {
	/** UMAC header, @ref nrf_wifi_sys_head. */
	struct nrf_wifi_sys_head sys_head;
	/** Interface index. */
	unsigned char if_index;
	/** Operating mode. */
	unsigned char op_mode;
	/** status of the set raw config mode command, success(0)/Fail(-1). */
	int status;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines an event that indicates set raw config
 * filter command done.
 *
 */
struct nrf_wifi_event_raw_config_filter {
	/** UMAC header, @ref nrf_wifi_sys_head. */
	struct nrf_wifi_sys_head sys_head;
	/** Interface index. */
	unsigned char if_index;
	/** mode filter configured. */
	unsigned char filter;
	/** capture len configured. */
	unsigned short capture_len;
	/** status of the set raw filter command, success(0)/Fail(-1). */
	int status;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines an event that indicates the Raw tx done.
 *
 */
struct nrf_wifi_event_raw_tx_done {
	/** UMAC header, @ref nrf_wifi_sys_head. */
	struct nrf_wifi_sys_head sys_head;
	/** descriptor number. */
	unsigned char desc_num;
	/** status of the raw tx packet command, success(0)/Fail(-1). */
	int status;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to clear or reset statistics.
 *
 *
 */
struct nrf_wifi_cmd_clear_stats {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Type of statistics to clear &enum rpu_stats_type */
	signed int stats_type;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command used to obtain power monitor information
 *  specific to different data types.
 *
 */
struct nrf_wifi_cmd_pwr {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Type of Control info that host need */
	signed int data_type;
} __NRF_WIFI_PKD;

/**
 * @brief Structure for coexistence (coex) switch configuration.
 *
 */
struct coex_wlan_switch_ctrl {
	/** Host to coexistence manager message id */
	signed int rpu_msg_id;
	/** Switch configuration value */
	signed int switch_A;
} __NRF_WIFI_PKD;

/**
 * @brief The structure represents the command used to configure the Wi-Fi side shared switch
 *  for SR coexistence.
 *
 */
struct nrf_wifi_cmd_srcoex {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Switch configuration data */
	struct coex_wlan_switch_ctrl conf;
} __NRF_WIFI_PKD;

/**
 * @brief The structure defines the parameters used to configure the coexistence hardware.
 *
 */

struct rpu_cmd_coex_config_info {
	/** Length of coexistence configuration data */
	unsigned int len;
	/** Coexistence configuration data */
	unsigned char coex_cmd[0];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to configure the coexistence hardware.
 *
 */
struct nrf_wifi_cmd_coex_config {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Coexistence configuration data. @ref rpu_cmd_coex_config_info */
	struct rpu_cmd_coex_config_info coex_config_info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure describes the coexistence configuration data received
 *  in the NRF_WIFI_EVENT_COEX_CONFIG event.
 *
 */
struct rpu_evnt_coex_config_info {
	/** Length of coexistence configuration data */
	unsigned int len;
	/** Coexistence configuration data */
	unsigned char coex_event[0];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the event used to represent coexistence configuration.
 *
 */
struct nrf_wifi_event_coex_config {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Coexistence configuration data in the event. @ref rpu_evnt_coex_config_info */
	struct rpu_evnt_coex_config_info coex_config_info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to fix the transmission (Tx) data rate.
 *  The command allows setting a specific data rate for data transmission, ensuring that the
 *  system uses the designated rate instead of dynamically adapting to changing channel conditions.
 *
 */

struct nrf_wifi_cmd_fix_tx_rate {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** refer see &enum rpu_tput_mode */
	unsigned char rate_flags;
	/** fixed_rate: -1 Disable fixed rate and use ratecontrol selected rate
	 *  fixed rate: >0 legacy rates: 1,2,55,11,6,9,12,18,24,36,48,54
	 *		  11N VHT HE  : MCS index 0 to 7.
	 */
	int fixed_rate;
} __NRF_WIFI_PKD;

/**
 * @brief This structure describes rf test command information.
 *
 */
struct rpu_cmd_rftest_info {
	/** length of the rf test command */
	unsigned int len;
	/** Rf test command data */
	unsigned char rfcmd[0];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used for RF (Radio Frequency) testing.
 *  RF test commands are specifically designed to configure and control the radio hardware
 *  for conducting tests and evaluating its performance in various scenarios.
 *
 */
struct nrf_wifi_cmd_rftest {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** @ref rpu_cmd_rftest_info */
	struct rpu_cmd_rftest_info rf_test_info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure describes rf test event information.
 *
 */
struct rpu_evnt_rftest_info {
	/** length of the rf test event */
	unsigned int len;
	/** Rf test event data */
	unsigned char rfevent[0];
} __NRF_WIFI_PKD;

/**
 * @brief This structure describes the event generated during RF (Radio Frequency) testing.
 *
 */
struct nrf_wifi_event_rftest {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** @ref rpu_evnt_rftest_info */
	struct rpu_evnt_rftest_info rf_test_info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure is a comprehensive combination of all the firmware statistics
 *  that the RPU (Radio Processing Unit) can provide in System mode.
 *
 */
struct rpu_sys_fw_stats {
	/** PHY statistics  @ref rpu_phy_stats */
	struct rpu_phy_stats phy;
	/** LMAC statistics @ref rpu_lmac_stats */
	struct rpu_lmac_stats lmac;
	/** UMAC statistics @ref rpu_umac_stats */
	struct rpu_umac_stats umac;
} __NRF_WIFI_PKD;

/**
 * @brief This structure is a comprehensive combination of all the firmware statistics
 *  that the RPU (Radio Processing Unit) can provide in Radio test mode.
 *
 */
struct rpu_rt_fw_stats {
	/** PHY statistics  @ref rpu_phy_stats */
	struct rpu_phy_stats phy;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the Offloaded raw tx debug statistics.
 *
 */
struct rpu_off_raw_tx_fw_stats {
	unsigned int offload_raw_tx_state;
	unsigned int offload_raw_tx_cnt;
	unsigned int offload_raw_tx_complete_cnt;
	unsigned int warm_boot_cnt;
} __NRF_WIFI_PKD;


/**
 * @brief This structure represents the event that provides RPU statistics in response
 * to the command NRF_WIFI_CMD_GET_STATS in a wireless communication system in System
 * mode.
 *
 *  The NRF_WIFI_CMD_GET_STATS command is used to request various statistics from the RPU.
 *
 */

