nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_common.h
struct nrf_wifi_sys_umac_event_stats {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** All the statistics that the firmware can provide @ref rpu_sys_fw_stats*/
	struct rpu_sys_fw_stats fw;
} __NRF_WIFI_PKD;


/**
 * @brief This structure represents the event that provides RPU statistics in response
 * to the command NRF_WIFI_CMD_GET_STATS in a wireless communication system in Radio
 * test mode.
 *
 *  The NRF_WIFI_CMD_GET_STATS command is used to request various statistics from the RPU.
 *
 */

struct nrf_wifi_rt_umac_event_stats {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** All the statistics that the firmware can provide @ref rpu_rt_fw_stats*/
	struct rpu_rt_fw_stats fw;
} __NRF_WIFI_PKD;


/**
 * @brief This structure represents the event that provides RPU statistics in response
 * to the command NRF_WIFI_CMD_GET_STATS in a wireless communication system in Offloaded
 * raw TX mode.
 *
 *  The NRF_WIFI_CMD_GET_STATS command is used to request various statistics from the RPU.
 *
 */

struct nrf_wifi_off_raw_tx_umac_event_stats {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** All the statistics that the firmware can provide @ref rpu_off_raw_tx_fw_stats*/
	struct rpu_off_raw_tx_fw_stats fw;
} __NRF_WIFI_PKD;


/**
 * @brief This enum defines various command status values that can occur
 * during radio tests and offloaded raw transmissions.
 */
enum nrf_wifi_cmd_status {
	/** Command success  */
	NRF_WIFI_UMAC_CMD_SUCCESS = 1,
	/** Invalid channel error */
	NRF_WIFI_UMAC_INVALID_CHNL,
	/** Invalid power error wrt configured regulatory domain */
	NRF_WIFI_UMAC_INVALID_TXPWR
};

/**
 * @brief This structure defines an event that indicates the error status values that may occur
 *  during a radio test. It serves as a response to the radio test commands.
 *
 */
struct nrf_wifi_umac_event_err_status {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** status of the command, Fail/success &enum nrf_wifi_radio_test_err_status */
	unsigned int status;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the UMAC initialization done event.
 *  The event is sent by the RPU (Radio Processing Unit) in response to
 *  the NRF_WIFI_CMD_INIT command, indicating that the RPU initialization
 *  process has been completed successfully.
 */

struct nrf_wifi_event_init_done {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the event that provides UMAC (Upper MAC) internal
 *  memory statistics in response to the NRF_WIFI_CMD_UMAC_INT_STATS command.
 *
 */
struct umac_int_stats {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** See @ref pool_data_to_host */
	struct pool_data_to_host scratch_dynamic_memory_info[56];
	/** See @ref pool_data_to_host */
	struct pool_data_to_host retention_dynamic_memory_info[56];
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the event that indicates the completion of UMAC
 *  deinitialization. The RPU sends this event as a response to the NRF_WIFI_CMD_DEINIT
 *  command, signaling that the UMAC has been successfully deinitialized.
 */

struct nrf_wifi_event_deinit_done {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
} __NRF_WIFI_PKD;

/**
 * @brief This structure describes the command for reset of interface statistics.
 *
 */
struct nrf_wifi_cmd_reset_stats {
	/** UMAC header, @ref nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
} __NRF_WIFI_PKD;

struct nrf_wifi_cmd_gi_config {
	/** umac header, see &nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Fixed Guard Interval Setting: 1 = Enable fixed guard interval, 0 = Disable (adaptive) */
	unsigned char is_guard_interval_fixed;
	/* Guard Interval Type: 1 = Long Guard Interval (LGI), 0 = Short Guard Interval (SGI) */
	unsigned char guard_interval_type;
} __NRF_WIFI_PKD;

#define NRF_WIFI_LMAC_MAX_RX_BUFS 256

#define HW_SLEEP_WITH_LP_RF 3
#define HW_SLEEP_ENABLE 2
#define SW_SLEEP_ENABLE 1
#define SLEEP_DISABLE 0
#define HW_DELAY 900
#define SW_DELAY 5000
#define BCN_TIMEOUT 20000
#define CALIB_SLEEP_CLOCK_ENABLE 1
#define ACTIVE_SCAN_DURATION 50
#define PASSIVE_SCAN_DURATION 130
#define WORKING_CH_SCAN_DURATION 50
#define CHNL_PROBE_CNT 2

#define		PKT_TYPE_MPDU				0
#define		PKT_TYPE_MSDU_WITH_MAC		1
#define		PKT_TYPE_MSDU				2

#define		NRF_WIFI_RPU_PWR_STATUS_SUCCESS	0
#define		NRF_WIFI_RPU_PWR_STATUS_FAIL	-1

/**
 * struct lmac_prod_stats - used to get the production mode stats
 **/

/* Events */
#define MAX_RSSI_SAMPLES 10
struct lmac_prod_stats {
	/*Structure that holds all the debug information in LMAC*/
	unsigned int resetCmdCnt;
	unsigned int resetCompleteEventCnt;
	unsigned int unableGenEvent;
	unsigned int chProgCmdCnt;
	unsigned int channelProgDone;
	unsigned int txPktCnt;
	unsigned int txPktDoneCnt;
	unsigned int scanPktCnt;
	unsigned int internalPktCnt;
	unsigned int internalPktDoneCnt;
	unsigned int ackRespCnt;
	unsigned int txTimeout;
	unsigned int deaggIsr;
	unsigned int deaggInptrDescEmpty;
	unsigned int deaggCircularBufferFull;
	unsigned int lmacRxisrCnt;
	unsigned int rxDecryptcnt;
	unsigned int processDecryptFail;
	unsigned int prepaRxEventFail;
	unsigned int rxCorePoolFullCnt;
	unsigned int rxMpduCrcSuccessCnt;
	unsigned int rxMpduCrcFailCnt;
	unsigned int rxOfdmCrcSuccessCnt;
	unsigned int rxOfdmCrcFailCnt;
	unsigned int rxDSSSCrcSuccessCnt;
	unsigned int rxDSSSCrcFailCnt;
	unsigned int rxCryptoStartCnt;
	unsigned int rxCryptoDoneCnt;
	unsigned int rxEventBufFull;
	unsigned int rxExtramBufFull;
	unsigned int scanReq;
	unsigned int scanComplete;
	unsigned int scanAbortReq;
	unsigned int scanAbortComplete;
	unsigned int internalBufPoolNull;
	unsigned int rpuLockupCnt;
	unsigned int rpuLockupRecoveryDone;
	unsigned int SQIThresholdCmdsCnt;
	unsigned int SQIConfigCmdsCnt;
	unsigned int SQIEventsCnt;
	unsigned int SleepType;
	unsigned int warmBootCnt;
};

/**
 * struct phy_prod_stats - used to get the production mode stats
 **/
struct phy_prod_stats {
	unsigned int ofdm_crc32_pass_cnt;
	unsigned int ofdm_crc32_fail_cnt;
	unsigned int dsss_crc32_pass_cnt;
	unsigned int dsss_crc32_fail_cnt;
	char averageRSSI;
};



union rpu_stats {
	struct lmac_prod_stats lmac_stats;
	struct phy_prod_stats phy_stats;
};


