nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_common.h
struct hpqmQueue {
	unsigned int pop_addr;
	unsigned int push_addr;
	unsigned int idNum;
	unsigned int status_addr;
	unsigned int status_mask;
} __NRF_WIFI_PKD;


struct INT_HPQ {
	unsigned int id;
	/* The head and tail values are relative
	 * to the start of the
	 * HWQM register block.
	 */
	unsigned int head;
	unsigned int tail;
} __NRF_WIFI_PKD;



/**
 * @brief lmac firmware config params
 */
struct lmac_fw_config_params {
	/** lmac firmware boot status. LMAC will set to 0x5a5a5a5a after completing boot process. */
	unsigned int boot_status;
	/** lmac firmware version */
	unsigned int version;
	unsigned int lmacRxBufferAddr;
	unsigned int lmacRxMaxDescCnt;
	unsigned int lmacRxDescSize;
	/** rpu config name. this is a string and expected sting is explorer or whisper */
	unsigned char rpu_config_name[16];
	/** rpu config number */
	unsigned char rpu_config_number[8];
	unsigned int numRX;
	unsigned int numTX;
	#define FREQ_2_4_GHZ 1
	#define FREQ_5_GHZ  2
	unsigned int bands;
	unsigned int sysFrequencyInMhz;
	/** queue which contains Free GRAM pointers for commands. */
	struct hpqmQueue FreeCmdPtrQ;
	/** Command pointer queue. Host picks gram pointer from FreeCmdPtrQ,
	 *  populates command in GRAM and submits back to this queue for RPU.
	 */
	struct hpqmQueue cmdPtrQ;
	/** Event pointer queue. Host should pick gram event pointer in isr */
	struct hpqmQueue eventPtrQ;
	struct hpqmQueue freeEventPtrQ;
	struct hpqmQueue SKBGramPtrQ_1;
	struct hpqmQueue SKBGramPtrQ_2;
	struct hpqmQueue SKBGramPtrQ_3;
	/** lmac register address to enable ISR to Host */
	unsigned int HP_lmac_to_host_isr_en;
	/** Address to Clear host ISR */
	unsigned int HP_lmac_to_host_isr_clear;
	/** Address to set ISR to lmac Clear host ISR */
	unsigned int HP_set_lmac_isr;

	#define NUM_32_QUEUES 4
	struct INT_HPQ hpq32[NUM_32_QUEUES];

} __NRF_WIFI_PKD;

/**
 * @brief This enum represents different types of operation modes.
 */
enum wifi_operation_modes {
	/** STA mode setting enable. */
	NRF_WIFI_STA_MODE = 0x1,
	/** Monitor mode setting enable. */
	NRF_WIFI_MONITOR_MODE = 0x2,
	/** TX injection mode setting enable. */
	NRF_WIFI_TX_INJECTION_MODE = 0x4,
	/** Promiscuous mode setting enable. */
	NRF_WIFI_PROMISCUOUS_MODE = 0x8,
	/** AP mode setting enable. */
	NRF_WIFI_AP_MODE = 0x10,
	/** STA-AP mode setting enable. */
	NRF_WIFI_STA_AP_MODE = 0x20,
	/** Max limit check based on current modes supported. */
	WIFI_MODE_LIMIT_CHK = 0x2f,
};


/**
 * @enum nrf_wifi_rf_test
 * @brief RF test commands for the Wi-Fi RPU (radio test mode).
 *
 * Supports RX ADC capture, RX packet capture (static and dynamic), TX tone
 * generation, and XO tune.
 */
enum nrf_wifi_rf_test {
	NRF_WIFI_RF_TEST_RX_ADC_CAP,
	NRF_WIFI_RF_TEST_RX_STAT_PKT_CAP,
	NRF_WIFI_RF_TEST_RX_DYN_PKT_CAP,
	NRF_WIFI_RF_TEST_TX_TONE,
	NRF_WIFI_RF_TEST_XO_TUNE,
	NRF_WIFI_RF_TEST_MAX,
};

/**
 * @enum nrf_wifi_rf_test_event
 * @brief RF test completion events from the RPU (radio test mode).
 */
enum nrf_wifi_rf_test_event {
	NRF_WIFI_RF_TEST_EVENT_RX_ADC_CAP,
	NRF_WIFI_RF_TEST_EVENT_RX_STAT_PKT_CAP,
	NRF_WIFI_RF_TEST_EVENT_RX_DYN_PKT_CAP,
	NRF_WIFI_RF_TEST_EVENT_TX_TONE_START,
	NRF_WIFI_RF_TEST_EVENT_XO_TUNE,
	NRF_WIFI_RF_TEST_EVENT_MAX,
};

#define NRF_WIFI_RF_TEST_RX_CAPTURE_MAX_SAMPLES 12256
#define MIN_CAPTURE_LEN 0
#define RX_CAPTURE_TIMEOUT_CONST 11
#define CAPTURE_DURATION_IN_SEC 600

/* Holds the RX capture related info */
struct nrf_wifi_rf_test_capture_params {
	unsigned char test;

	/* Number of samples to be captured. */
	unsigned short int cap_len;

	/* Capture timeout in seconds. */
	unsigned short int cap_time;

	/* Capture status codes:
	 *0: Capture successful after WLAN packet detection
	 *1: Capture failed after WLAN packet detection
	 *2: Capture timedout as no WLAN packets are detected
	 */
	unsigned char capture_status;

	/* LNA Gain to be configured. It is a 3 bit value. The mapping is,
	 * '0' = 24dB
	 * '1' = 18dB
	 * '2' = 12dB
	 * '3' = 0dB
	 * '4' = -12dB
	 */
	unsigned char lna_gain;

	/* Baseband Gain to be configured. It is a 5 bit value.
	 * It supports 64dB range.The increment happens lineraly 2dB/step
	 */
	unsigned char bb_gain;

	/* OFDM / DSSS ED thresholds in dBm for NRF_WIFI_RF_TEST_RX_DYN_PKT_CAP */
	unsigned char ed_thresh_ofdm;
	unsigned char ed_thresh_dsss;

	/* address of the capture data */
	unsigned int *capture_addr;
} __NRF_WIFI_PKD;

/** Tone type for RF test TX tone: 0 = complex, 1 = real-only, 2 = imag-only. */
enum nrf_wifi_rf_test_tone_type {
	NRF_WIFI_RF_TEST_TONE_COMPLEX = 0,
	NRF_WIFI_RF_TEST_TONE_REAL    = 1,
	NRF_WIFI_RF_TEST_TONE_IMAG    = 2,
};

/* Holds the transmit related info */
struct nrf_wifi_rf_test_tx_params {
	unsigned char test;

	/* Desired tone frequency in MHz in steps of 1 MHz from -10 MHz to +10 MHz. */
	signed char tone_freq;

	/* Desired TX power in the range -16 dBm to +24 dBm.
	 * in steps of 2 dBm
	 */
	signed char tx_pow;

	/* Set 1 for staring tone transmission. */
	unsigned char enabled;

	/* DC offset for I channel. Format: Q.11 */
	signed short int dc_offset_i;

	/* DC offset for Q channel. Format: Q.11 */
	signed short int dc_offset_q;

	/** Tone type: 0=complex, 1=real-only, 2=imag-only */
	unsigned char tone_type;
} __NRF_WIFI_PKD;

struct nrf_wifi_rf_get_xo_value {
	unsigned char test;

	/* XO offset in PPM (Gen3B). */
	signed int xo_offset;

	/* Status: 0 = success, 1 = tone not detected, 2 = gain fail (high),
	 * 3 = gain fail (low), 4 = gain fail (timeout)
	 */
	unsigned char status;
} __NRF_WIFI_PKD;

/* TODO: Below OTP + PCB loss won't work for nRF71, but added
 * here to avoid code churn. Need to revisit this.
 */
#define NUM_PCB_LOSS_OFFSET 4

/** The byte offsets of RF parameters indicate the start offset
 * of PCB loss for 2.4 GHz and 5 GHz bands.
 */
enum PCB_LOSS_BYTE_OFFSETS {
	PCB_LOSS_BYTE_2G_OFST = 185,
	PCB_LOSS_BYTE_5G_BAND1_OFST,
	PCB_LOSS_BYTE_5G_BAND2_OFST,
	PCB_LOSS_BYTE_5G_BAND3_OFST
};

/** The byte offsets of RF parameters indicate the start offset
 * of band edge backoffs for different frame formats and
 * different sub-bands of 2.4 GHz and 5 GHz frequency band.
 */
enum EDGE_BACKOFF_OFFSETS {
	BAND_2G_LW_ED_BKF_DSSS_OFST = 155,
	BAND_2G_LW_ED_BKF_HT_OFST,
	BAND_2G_LW_ED_BKF_HE_OFST,
	BAND_2G_UW_ED_BKF_DSSS_OFST,
	BAND_2G_UW_ED_BKF_HT_OFST,
	BAND_2G_UW_ED_BKF_HE_OFST,
	BAND_UNII_1_LW_ED_BKF_HT_OFST,
	BAND_UNII_1_LW_ED_BKF_HE_OFST,
	BAND_UNII_1_UW_ED_BKF_HT_OFST,
	BAND_UNII_1_UW_ED_BKF_HE_OFST,
	BAND_UNII_2A_LW_ED_BKF_HT_OFST,
	BAND_UNII_2A_LW_ED_BKF_HE_OFST,
	BAND_UNII_2A_UW_ED_BKF_HT_OFST,
	BAND_UNII_2A_UW_ED_BKF_HE_OFST,
	BAND_UNII_2C_LW_ED_BKF_HT_OFST,
	BAND_UNII_2C_LW_ED_BKF_HE_OFST,
	BAND_UNII_2C_UW_ED_BKF_HT_OFST,
	BAND_UNII_2C_UW_ED_BKF_HE_OFST,
	BAND_UNII_3_LW_ED_BKF_HT_OFST,
	BAND_UNII_3_LW_ED_BKF_HE_OFST,
	BAND_UNII_3_UW_ED_BKF_HT_OFST,
	BAND_UNII_3_UW_ED_BKF_HE_OFST,
	BAND_UNII_4_LW_ED_BKF_HT_OFST,
	BAND_UNII_4_LW_ED_BKF_HE_OFST,
	BAND_UNII_4_UW_ED_BKF_HT_OFST,
	BAND_UNII_4_UW_ED_BKF_HE_OFST,
	NUM_EDGE_BACKOFF = 26
};


/* Size of XO calibration value stored in the OTP field CALIB_XO */
#define OTP_SZ_CALIB_XO 1

/* Byte offsets of XO calib value in CALIB_XO field in the OTP */
#define OTP_OFF_CALIB_XO 0

/* Masks to program bit fields in REGION_DEFAULTS field in the OTP */
#define QSPI_KEY_FLAG_MASK ~(1U<<0)
#define MAC0_ADDR_FLAG_MASK ~(1U<<1)
#define MAC1_ADDR_FLAG_MASK ~(1U<<2)
#define CALIB_XO_FLAG_MASK ~(1U<<3)

/* RF register address to facilitate OTP access */
#define OTP_VOLTCTRL_ADDR 0x19004
/* Voltage value to be written into the above RF register for OTP write access */
#define OTP_VOLTCTRL_2V5 0x3b
/* Voltage value to be written into the above RF register for OTP read access */
#define OTP_VOLTCTRL_1V8 0xb

