nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_common.h
#define OTP_POLL_ADDR 0x01B804
#define OTP_WR_DONE 0x1
#define OTP_READ_VALID 0x2
#define OTP_READY 0x4


#define OTP_RWSBMODE_ADDR 0x01B800
#define OTP_READ_MODE 0x1
#define OTP_BYTE_WRITE_MODE 0x42


#define OTP_RDENABLE_ADDR 0x01B810
#define OTP_READREG_ADDR 0x01B814

#define OTP_WRENABLE_ADDR 0x01B808
#define OTP_WRITEREG_ADDR 0x01B80C

#define OTP_TIMING_REG1_ADDR 0x01B820
#define OTP_TIMING_REG1_VAL 0x0
#define OTP_TIMING_REG2_ADDR 0x01B824
#define OTP_TIMING_REG2_VAL 0x030D8B

#define OTP_FRESH_FROM_FAB 0xFFFFFFFF
#define OTP_PROGRAMMED 0x00000000
#define OTP_ENABLE_PATTERN 0x50FA50FA
#define OTP_INVALID 0xDEADBEEF

#define FT_PROG_VER_MASK 0xF0000

/**
 * @struct nrf_wifi_board_params
 * @brief This structure defines board dependent parameters like PCB loss.
 *
 */
struct nrf_wifi_board_params {
	/** PCB loss for 2.4 GHz band */
	unsigned char pcb_loss_2g;
	/** PCB loss for 5 GHz band (5150 MHz - 5350 MHz) */
	unsigned char pcb_loss_5g_band1;
	/** PCB loss for 5 GHz band (5470 MHz - 5730 MHz) */
	unsigned char pcb_loss_5g_band2;
	/** PCB loss for 5 GHz band (5730 MHz - 5895 MHz) */
	unsigned char pcb_loss_5g_band3;
} __NRF_WIFI_PKD;

/**
 * @struct host_rpu_umac_info
 * @brief This structure represents the information related to UMAC.
 *
 */
struct host_rpu_umac_info {
	/** Boot status signature */
	unsigned int boot_status;
	/** UMAC version */
	unsigned int version;
	/** OTP params */
	unsigned int info_part;
	/** OTP params */
	unsigned int info_variant;
	/** OTP params */
	unsigned int info_lromversion;
	/** OTP params */
	unsigned int info_uromversion;
	/** OTP params */
	unsigned int info_uuid[4];
	/** OTP params */
	unsigned int info_spare0;
	/** OTP params */
	unsigned int info_spare1;
	/** OTP params */
	unsigned int mac_address0[2];
	/** OTP params */
	unsigned int mac_address1[2];
	/** OTP params */
	unsigned int calib[9];
} __NRF_WIFI_PKD;

/**
 * @brief Structure to hold OTP region information.
 *
 */
struct nrf_wifi_fmac_otp_info {
	/** OTP region information. */
	struct host_rpu_umac_info info;
	/** Flags indicating which OTP regions are valid. */
	unsigned int flags;
};


/** XO adjustment value */
struct nrf_wifi_xo_freq_offset {
	unsigned char xo_freq_offset;
} __NRF_WIFI_PKD;

/** Power detector adjustment factor for MCS7 */
struct nrf_wifi_pd_adst_val {
	/** PD adjustment value corresponding to Channel 7 */
	signed char pd_adjt_lb_chan;
	/** PD adjustment value corresponding to Channel 36 */
	signed char pd_adjt_hb_low_chan;
	/** PD adjustment value corresponding to Channel 100 */
	signed char pd_adjt_hb_mid_chan;
	/** PD adjustment value corresponding to Channel 165 */
	signed char pd_adjt_hb_high_chan;
} __NRF_WIFI_PKD;

/** TX power systematic offset is the difference between set power
 *  and the measured power
 */
struct nrf_wifi_tx_pwr_systm_offset {
	/** Systematic adjustment value corresponding to Channel 7 */
	signed char syst_off_lb_chan;
	/** Systematic adjustment value corresponding to Channel 36 */
	signed char syst_off_hb_low_chan;
	/** Systematic adjustment value corresponding to Channel 100 */
	signed char syst_off_hb_mid_chan;
	/** Systematic adjustment value corresponding to Channel 165 */
	signed char syst_off_hb_high_chan;
} __NRF_WIFI_PKD;

/** Max TX power value for which both EVM and SEM pass */
struct nrf_wifi_tx_pwr_ceil {
	/** Max output power for 11b for channel 7 */
	signed char max_dsss_pwr;
	/** Max output power for MCS7 for channel 7 */
	signed char max_lb_mcs7_pwr;
	/** Max output power for MCS0 for channel 7 */
	signed char max_lb_mcs0_pwr;
	/** Max output power for MCS7 for channel 36 */
	signed char max_hb_low_chan_mcs7_pwr;
	/** Max output power for MCS7 for channel 100 */
	signed char max_hb_mid_chan_mcs7_pwr;
	/** Max output power for MCS7 for channel 165 */
	signed char max_hb_high_chan_mcs7_pwr;
	/** Max output power for MCS0 for channel 36 */
	signed char max_hb_low_chan_mcs0_pwr;
	/** Max output power for MCS0 for channel 100 */
	signed char max_hb_mid_chan_mcs0_pwr;
	/** Max output power for MCS0 for channel 165 */
	signed char max_hb_high_chan_mcs0_pwr;
} __NRF_WIFI_PKD;

/** RX gain adjustment offsets */
struct nrf_wifi_rx_gain_offset {
	/** Channel 7 */
	signed char rx_gain_lb_chan;
	/** Channel 36 */
	signed char rx_gain_hb_low_chan;
	/** Channel 100 */
	signed char rx_gain_hb_mid_chan;
	/** Channel 165 */
	signed char rx_gain_hb_high_chan;
} __NRF_WIFI_PKD;

/** Voltage and temperature dependent backoffs */
struct nrf_wifi_temp_volt_depend_params {
	/** Maximum chip temperature in centigrade */
	signed char max_chip_temp;
	/** Minimum chip temperature in centigrade */
	signed char min_chip_temp;
	/** TX power backoff at high temperature in 2.4GHz */
	signed char lb_max_pwr_bkf_hi_temp;
	/** TX power backoff at low temperature in 2.4GHz */
	signed char lb_max_pwr_bkf_low_temp;
	/** TX power backoff at high temperature in 5GHz */
	signed char hb_max_pwr_bkf_hi_temp;
	/** TX power backoff at low temperature in 5GHz */
	signed char hb_max_pwr_bkf_low_temp;
	/** Voltage back off value in LowBand when VBAT< VBAT_VERYLOW */
	signed char lb_vbt_lt_vlow;
	/** Voltage back off value in HighBand when VBAT< VBAT_VERYLOW */
	signed char hb_vbt_lt_vlow;
	/** Voltage back off value in LowBand when VBAT< VBAT_LOW */
	signed char lb_vbt_lt_low;
	/** Voltage back off value in HighBand when VBAT< VBAT_LOW */
	signed char hb_vbt_lt_low;
	/** Reserved bytes */
	signed char reserved[4];
} __NRF_WIFI_PKD;

/** The top-level structure holds substructures,
 * each containing information related to the
 * first 42 bytes of RF parameters.
 */
struct nrf_wifi_phy_rf_params {
	unsigned char reserved[6];
	struct nrf_wifi_xo_freq_offset xo_offset;
	struct nrf_wifi_pd_adst_val pd_adjust_val;
	struct nrf_wifi_tx_pwr_systm_offset syst_tx_pwr_offset;
	struct nrf_wifi_tx_pwr_ceil max_pwr_ceil;
	struct nrf_wifi_rx_gain_offset rx_gain_offset;
	struct nrf_wifi_temp_volt_depend_params temp_volt_backoff;
	unsigned char phy_params[NRF_WIFI_RF_PARAMS_SIZE - NRF_WIFI_RF_PARAMS_CONF_SIZE];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the parameters used to control the max transmit (TX) power
 * in both frequency bands for different data rates.
 */
struct nrf_wifi_tx_pwr_ceil_params {
	/** Maximum power permitted while transmitting DSSS rates in 2.4G band.
	 *  Resolution is 0.25dBm.
	 */
	unsigned char max_pwr_2g_dsss;
	/** Maximum power permitted while transmitting MCS0 rate in 2.4G band.
	 *  Resolution is 0.25dBm.
	 */
	unsigned char max_pwr_2g_mcs0;
	/** Maximum power permitted while transmitting MCS7 rate in 2.4G band.
	 *  Resolution is 0.25dBm.
	 */
	unsigned char max_pwr_2g_mcs7;

	/** Maximum power permitted while transmitting MCS0 rate in 5G lowband.
	 * Low band corresponds to ch: 36 to 64 Resolution is 0.25dBm.
	 */
	unsigned char max_pwr_5g_low_mcs0;
	/** Maximum power permitted while transmitting MCS7 rate in 5G lowband.
	 * Low band corresponds to ch: 36 to 64, resolution is 0.25dBm.
	 */
	unsigned char max_pwr_5g_low_mcs7;
	/** Maximum power permitted while transmitting MCS0 rate in 5G midband.
	 * Mid band corresponds to ch: 96 to 132, resolution is 0.25dBm.
	 */
	unsigned char max_pwr_5g_mid_mcs0;
	/** Maximum power permitted while transmitting MCS7 rate in 5G midband.
	 * Mid band corresponds to ch: 96 to 132, resolution is 0.25dBm.
	 */
	unsigned char max_pwr_5g_mid_mcs7;
	/** Maximum power permitted while transmitting MCS0 rate in 5G highband.
	 * High band corresponds to ch: 136 to 177, resolution is 0.25dBm.
	 */
	unsigned char max_pwr_5g_high_mcs0;
	/** Maximum power permitted while transmitting MCS7 rate in 5G highband.
	 * High band corresponds to ch: 136 to 177, resolution is 0.25dBm.
	 */
	unsigned char max_pwr_5g_high_mcs7;
} __NRF_WIFI_PKD;

