nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_common.h
struct nrf_wifi_cmd_coding_type_config {
	/** umac header, see &nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** 0 = BCC 1= LDPC */
	unsigned char coding_type;
} __NRF_WIFI_PKD;

struct nrf_wifi_cmd_xo_tune {
	/** umac header, see &nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** xo value */
	int xo_val;
} __NRF_WIFI_PKD;

/**
 * Below NRF_WIFI_SQI_* Macros are used for SQI feature
 */
#define NRF_WIFI_SQI_RSSI_MIN -90
#define NRF_WIFI_SQI_RSSI_MAX -60
#define NRF_WIFI_SQI_RSSI_HYST_MIN 4
#define NRF_WIFI_SQI_RSSI_HYST_MAX 6
#define NRF_WIFI_SQI_RSSI_HYST_DEF 4

/**
 * @enum nrf_wifi_sqi
 * @brief Enumerates the available signal sources for SQI measurement.
 *
 * This enumeration defines the various signal sources that can be used for
 * Signal Quality Indicator (SQI) measurement in the Wi-Fi RPU.
 *
 */
enum nrf_wifi_sqi {
	/** Invalid SQI source */
	NRF_WIFI_SQI_RX_INVALID = 0,
	/** Beacon frames */
	NRF_WIFI_SQI_RX_BCN = (1 << 0),
	/** Unicast and broadcast frames */
	NRF_WIFI_SQI_RX_UCAST_BCAST = (1 << 1),
	/** BSS traffic unicast frames */
	NRF_WIFI_SQI_RX_BSS_TP_UCAST = (1 << 2),
	/* @NRF_WIFI_SQI_RX_ALL sets all the above flags */
	NRF_WIFI_SQI_RX_ALL = (1 << 3) - 1,
} __NRF_WIFI_PKD;

/**
 * @enum nrf_wifi_sqi_sample_count
 * @brief Enumerates the available sample counts for SQI measurement.
 *
 * This enumeration defines the various sample counts that can be used for
 * Signal Quality Indicator (SQI) measurement in the Wi-Fi RPU.
 */
enum nrf_wifi_sqi_sample_count {
	/** 4 samples */
	NRF_WIFI_SQI_SAMPLE_COUNT_4 = 4,
	/** 8 samples */
	NRF_WIFI_SQI_SAMPLE_COUNT_8 = 8,
	/** 16 samples */
	NRF_WIFI_SQI_SAMPLE_COUNT_16 = 16,
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the parameters used to configure
 * Signal Quality Indicator (SQI) measurement.
 */
struct nrf_wifi_cmd_sqi {
	/** umac header, see &nrf_wifi_sys_head */
	struct nrf_wifi_sys_head sys_head;
	/** Signal source for SQI measurement */
	unsigned int nrf_wifi_signal_src;
	/** Number of average samples count */
	unsigned int nrf_wifi_avg_cnt;
} __NRF_WIFI_PKD;

struct lmac_tuning_params {
	unsigned int ofdm_sifs_value;
	unsigned int dsss_sifs_value;
	unsigned int cfg_bet_enable;
	unsigned int lp_rx_enable;
	unsigned int ack_margin;
	unsigned int data_path_watch_dog_timer; /* legacy name kept for compatibility */
	unsigned int tsf_comp_for_ofsets; /* legacy field name */
	unsigned int inactivity_timer;
	unsigned int bcst_wait_period;
	unsigned int inactivity_timer_after_rx;
	unsigned int tsf_correction_enable;
	unsigned int allowed_bcn_miss_before_wakeup;
	unsigned int beacon_wait_time;
	unsigned int wifi_priority_for_coldboot;
	unsigned int wifi_priority_for_warmboot;
	unsigned int wifi_priority_for_shdn;
	unsigned int wifi_priority_for_chnlprog;
	unsigned int scan_priority_for_pta;
	unsigned int protect_beacon_period;
	unsigned int beacon_coex_priority;
	unsigned int protect_connection_period;
	unsigned int coex_mgmt_priority;
	unsigned int additional_retry_bk;
	unsigned int additional_retry_be;
	unsigned int additional_retry_vi;
	unsigned int additional_retry_vo;
	unsigned int enable_vif_tsmc;
	unsigned int vif_channel_switch_delay;
	unsigned int vif_window_size_in_usec;
	unsigned int cts_duration_field;
	unsigned int offloadTXChecksum;
	unsigned int offloadRXChecksum;
	unsigned int internal_recovery_enable;
	unsigned int ppmError;
	unsigned int reSyncTime;
	unsigned int syncTSF;
	unsigned int raw_tx_inactivity_timer;
	unsigned int adjustEDCACW;
	unsigned int setCWforAC;
	unsigned int ftm_delay;
	unsigned int connection_inactivity_timer;
	int tod_offset;
	int toa_offset;
	unsigned int clock_mode;
	/* reserved for patching */
	unsigned int reserved[16];
} __NRF_WIFI_PKD;

struct nrf_wifi_vtf_params {
	unsigned int voltage;
	unsigned int temp;
	unsigned int x0_freq;
} __NRF_WIFI_PKD;

struct nrf_wifi_cmd_lmac_tuning_params {
	/** UMAC header, @ref nrf_wifi_sys_head*/
	struct nrf_wifi_sys_head sys_head;
	/** LMAC tuning parameters */
	struct lmac_tuning_params params;
} __NRF_WIFI_PKD;

/**
 * @}
 */
#endif /* __NRF71_WIFI_COMMON_H__ */
